
// СтандартныеПодсистемы

#Область ОписаниеПеременных

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
// Конец ПодключаемоеОборудование

#КонецОбласти

// Конец СтандартныеПодсистемы


#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователейКлиент.ПередНачаломРаботыСистемы();
	// Конец ИнтернетПоддержкаПользователей
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
	////////////////////////////////START Авитим//////////////////////////////////////// 
	// Автор: Жамбакиева Т.А.
	// Дата: 05.01.2020
	//                                         
	// Описание:
	//
	//
	
	////Если Не авУведомленияПриЗапуске.ДоступностьРоли() Тогда ////Эту строчку закоментил Кривяк 06.01.2020 
	                                                            ////нельзя оставлять такой код не доделав
														        ////он не даёт запустить программу!!!
	////////////////////////////////FINISH Авитим/////////////////////////////////////// 
	
	
	
	////////////////////////////////START Авитим//////////////////////////////////////// 
    // Автор: Литвинов С.В.
    // Дата: 13.12.2019 21:00
    //
    // Описание: Запускаем проверку наличия увдомлений и при наличии уведомляем
	МаксОстатокДней = 30;
	Если авУведомленияПриЗапуске.УведомлениеОбОкончанииДекрОтпуска(МаксОстатокДней) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтвета",авОбработчикиОповещений),
		                     "Имеются сотрудники до окончания отпуска которых осталось меньше " + МаксОстатокДней + " дней"
							 + Символы.ПС + "Показать отчёт?",
		                     РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
						 
	Если авУведомленияПриЗапуске.УведомлениеОбОкончанииТрудДоговораИспСрокаРабочВизыИВидаНаЖительство(МаксОстатокДней) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтвета2",авОбработчикиОповещений),
		                     "Имеются сотрудники у которых истекает трудовой договор, " 
							 + Символы.ПС +"либо испытательный срок, либо вид на жительство, либо рабочая виза " 
							 + "осталось менее " +МаксОстатокДней + " дней"
							 + Символы.ПС + "Показать отчёт?",
		                     РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;					 
	////КонецЕсли;
	
    ////////////////////////////////FINISH Авитим///////////////////////////////////////
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	// ПодключаемоеОборудование
	// Подготовить данные
	
	ОписаниеСобытия = Новый Структура();
	ОписаниеОшибки  = "";
	
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	
	// Передать на обработку данные.
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.'")
		                                                 + Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

#КонецОбласти